Repository: DZXH-TX/LocaleSmith
Catalog: src/LocaleSmith.App/Strings/*/Resources.resw
Source language: en_us
Languages: fr_fr, ja_jp, ru_ru, zh_cn

# QueueCancelAccessibleName
source: Cancel translation job {0}
fr_fr: Annuler la tâche de traduction {0}
ja_jp: 翻訳ジョブ {0} をキャンセル
ru_ru: Отменить задание перевода {0}
zh_cn: 取消翻译任务 {0}

# CancelQueueItemButton.ToolTipService.ToolTip
source: Cancel job
fr_fr: Annuler la tâche
ja_jp: ジョブをキャンセル
ru_ru: Отменить задание
zh_cn: 取消任务

# FormalArtifactLabel.Text
source: Formal artifact:
fr_fr: Artefact formel :
ja_jp: 正式版の成果物:
ru_ru: Артефакт официального перевода:
zh_cn: 正式版工件：

# InformalArtifactLabel.Text
source: Informal artifact:
fr_fr: Artefact informel :
ja_jp: 口語版の成果物:
ru_ru: Артефакт неформального перевода:
zh_cn: 非正式版工件：

# HardcodedFoundPrefix.Text
source: Hard-coded candidates:
fr_fr: Candidats codés en dur :
ja_jp: ハードコード候補:
ru_ru: Возможные жёстко заданные строки:
zh_cn: 硬编码候选：

# HardcodedExternalizedPrefix.Text
source: ; externalized:
fr_fr: ; externalisés :
ja_jp: ; 外部化済み:
ru_ru: ; вынесено в ресурсы:
zh_cn: ；已外部化：

# HardcodedReadonlySuffix.Text
source: (safe mode in this release)
fr_fr: (mode sécurisé dans cette version)
ja_jp: （このリリースでは安全モードのみ）
ru_ru: (безопасный режим в этой версии)
zh_cn: （首版仅安全模式）

# LogsTitle.Text
source: Translation logs
fr_fr: Journaux de traduction
ja_jp: 翻訳ログ
ru_ru: Журналы переводов
zh_cn: 翻译日志

# LogsSubtitle.Text
source: Review each translation transaction. Debug is selected by default; switch to all levels when needed.
fr_fr: Examinez chaque transaction de traduction. Debug est sélectionné par défaut ; passez à tous les niveaux si nécessaire.
ja_jp: 翻訳ごとのトランザクションを確認します。既定では Debug が選択されています。必要に応じて全レベルに切り替えてください。
ru_ru: Просматривайте каждую операцию перевода. По умолчанию выбран Debug; при необходимости переключитесь на все уровни.
zh_cn: 查看每次翻译的事务记录；默认仅显示 Debug 视图，可切换到全部级别。

# LogsSessionSelector.Header
source: Translation session
fr_fr: Session de traduction
ja_jp: 翻訳セッション
ru_ru: Сеанс перевода
zh_cn: 翻译会话

# LogsSessionSelector.PlaceholderText
source: No logs available
fr_fr: Aucun journal disponible
ja_jp: 利用できるログがありません
ru_ru: Журналы отсутствуют
zh_cn: 没有可用日志

# LogsSessionSelector.AutomationProperties.Name
source: Select a translation log
fr_fr: Sélectionner un journal de traduction
ja_jp: 翻訳ログを選択
ru_ru: Выбрать журнал перевода
zh_cn: 选择一次翻译日志

# LogsViewSelector.Header
source: Log view
fr_fr: Vue du journal
ja_jp: ログ表示
ru_ru: Представление журнала
zh_cn: 日志视图

# LogsViewSelector.AutomationProperties.Name
source: Select the log-level view
fr_fr: Sélectionner la vue par niveau de journalisation
ja_jp: ログレベルの表示を選択
ru_ru: Выбрать представление уровней журнала
zh_cn: 选择日志级别视图

# LogsRefreshButtonText.Text
source: Refresh
fr_fr: Actualiser
ja_jp: 更新
ru_ru: Обновить
zh_cn: 刷新

# LogsRefreshButton.AutomationProperties.Name
source: Refresh the translation log list
fr_fr: Actualiser la liste des journaux de traduction
ja_jp: 翻訳ログの一覧を更新
ru_ru: Обновить список журналов перевода
zh_cn: 刷新翻译日志列表

# LogsRefreshButton.ToolTipService.ToolTip
source: Scan the log directory again
fr_fr: Analyser à nouveau le répertoire des journaux
ja_jp: ログディレクトリを再スキャン
ru_ru: Повторно просканировать каталог журналов
zh_cn: 重新扫描日志目录

# LogsDirectoryLabel.Text
source: Log directory
fr_fr: Répertoire des journaux
ja_jp: ログディレクトリ
ru_ru: Каталог журналов
zh_cn: 日志目录

# LogsDirectoryPath.AutomationProperties.Name
source: Configured translation log directory
fr_fr: Répertoire configuré des journaux de traduction
ja_jp: 設定済みの翻訳ログディレクトリ
ru_ru: Настроенный каталог журналов перевода
zh_cn: 已配置的翻译日志目录

# LogsError.Title
source: Logs could not be read
fr_fr: Impossible de lire les journaux
ja_jp: ログを読み取れませんでした
ru_ru: Не удалось прочитать журналы
zh_cn: 无法读取日志

# LogsBusy.AutomationProperties.Name
source: Reading translation logs
fr_fr: Lecture des journaux de traduction
ja_jp: 翻訳ログを読み取っています
ru_ru: Чтение журналов перевода
zh_cn: 正在读取翻译日志

# LogsEmptyTitle.Text
source: No translation logs to display yet
fr_fr: Aucun journal de traduction à afficher pour le moment
ja_jp: 表示できる翻訳ログはまだありません
ru_ru: Пока нет журналов перевода для отображения
zh_cn: 还没有可显示的翻译日志

# LogsEmptyBody.Text
source: Run or complete a translation, then select its session here to view Debug or all-level entries.
fr_fr: Lancez ou terminez une traduction, puis sélectionnez sa session ici pour consulter les entrées Debug ou de tous les niveaux.
ja_jp: 翻訳を実行または完了した後、ここでセッションを選択して Debug または全レベルの記録を表示します。
ru_ru: Запустите или завершите перевод, затем выберите здесь его сеанс для просмотра записей Debug или всех уровней.
zh_cn: 完成或运行一次翻译后，在此选择会话并查看 Debug 或全部级别记录。

# LogsContent.AutomationProperties.Name
source: Log content for the selected translation session
fr_fr: Contenu du journal de la session de traduction sélectionnée
ja_jp: 選択した翻訳セッションのログ内容
ru_ru: Содержимое журнала выбранного сеанса перевода
zh_cn: 所选翻译会话的日志内容

# LogViewModeAllLevels
source: All levels
fr_fr: Tous les niveaux
ja_jp: 全レベル
ru_ru: Все уровни
zh_cn: 全部级别

# LogsLoadFailed
source: Translation logs could not be loaded. Check the configured directory and its permissions, then try again.
fr_fr: Impossible de charger les journaux de traduction. Vérifiez le répertoire configuré et ses autorisations, puis réessayez.
ja_jp: 翻訳ログを読み込めませんでした。設定済みディレクトリとそのアクセス許可を確認してから、もう一度お試しください。
ru_ru: Не удалось загрузить журналы перевода. Проверьте настроенный каталог и разрешения для него, затем повторите попытку.
zh_cn: 无法加载翻译日志。请检查设置中的日志目录及其权限后重试。

# ModelSourcesTitle.Text
source: Model sources
fr_fr: Sources de modèles
ja_jp: モデルソース
ru_ru: Источники моделей
zh_cn: 模型源

# NewModelSourceButtonText.Text
source: New
fr_fr: Nouveau
ja_jp: 新規
ru_ru: Создать
zh_cn: 新建

# ModelSourcesList.AutomationProperties.Name
source: Configured model sources
fr_fr: Sources de modèles configurées
ja_jp: 設定済みのモデルソース
ru_ru: Настроенные источники моделей
zh_cn: 已配置模型源

# ModelSourceEditorTitle.Text
source: Model source details
fr_fr: Détails de la source de modèle
ja_jp: モデルソースの詳細
ru_ru: Сведения об источнике модели
zh_cn: 模型源详细设置

# CompactModelSourcesSelector.Header
source: Select model source
fr_fr: Sélectionner une source de modèle
ja_jp: モデルソースを選択
ru_ru: Выберите источник модели
zh_cn: 选择模型源

# ProviderChangeWarning.Title
source: Keep unsaved content?
fr_fr: Conserver le contenu non enregistré ?
ja_jp: 未保存の内容を保持しますか?
ru_ru: Сохранить несохранённые данные?
zh_cn: 保留未保存内容？

# ProviderChangeWarning.Message
source: A provider change was requested. Apply it or keep the current provider; the form is never silently discarded.
fr_fr: Un changement de fournisseur a été demandé. Appliquez-le ou conservez le fournisseur actuel ; le formulaire n’est jamais abandonné silencieusement.
ja_jp: プロバイダーの変更が要求されました。変更を適用するか、現在のプロバイダーを保持してください。フォームの内容が確認なく破棄されることはありません。
ru_ru: Запрошена смена провайдера. Примените её или оставьте текущего провайдера; содержимое формы не будет потеряно без предупреждения.
zh_cn: 提供商已请求更改。选择应用或保留当前提供商；表单内容不会被静默丢弃。

# KeepProviderButton.Content
source: Keep current
fr_fr: Conserver l’actuel
ja_jp: 現在の設定を保持
ru_ru: Оставить текущего
zh_cn: 保留当前

# ApplyProviderButton.Content
source: Apply change
fr_fr: Appliquer le changement
ja_jp: 変更を適用
ru_ru: Применить изменение
zh_cn: 应用更改

# ModelSourceError.Title
source: Model source error
fr_fr: Erreur de source de modèle
ja_jp: モデルソースエラー
ru_ru: Ошибка источника модели
zh_cn: 模型源错误

# ModelSourceStatus.Title
source: Saved
fr_fr: Enregistré
ja_jp: 保存済み
ru_ru: Сохранено
zh_cn: 已保存

# ModelSourceDisplayName.Header
source: Display name
fr_fr: Nom d’affichage
ja_jp: 表示名
ru_ru: Отображаемое имя
zh_cn: 显示名称

# ModelSourceProvider.Header
source: Provider
fr_fr: Fournisseur
ja_jp: プロバイダー
ru_ru: Провайдер
zh_cn: 提供商

# ModelSourcePreset.Header
source: Provider preset (editable defaults)
fr_fr: Préréglage du fournisseur (valeurs par défaut modifiables)
ja_jp: プロバイダーのプリセット（既定値は編集可能）
ru_ru: Предустановка провайдера (изменяемые значения по умолчанию)
zh_cn: 提供方预设（默认值可编辑）

# ModelSourcePresetDocumentation.Content
source: Open official API documentation
fr_fr: Ouvrir la documentation officielle de l’API
ja_jp: 公式 API ドキュメントを開く
ru_ru: Открыть официальную документацию API
zh_cn: 打开官方 API 文档

# ModelSourceTokenLimitParameter.Header
source: Completion token parameter
fr_fr: Paramètre des jetons de complétion
ja_jp: 完了トークンパラメーター
ru_ru: Параметр ограничения токенов ответа
zh_cn: 补全 Token 参数

# ModelSourceTokenLimitParameterHelp.Text
source: Use the recommended field, choose a different compatible field, or omit it and let the provider decide. Connection tests and translation requests honor the same choice.
fr_fr: Utilisez le champ recommandé, choisissez un autre champ compatible, ou omettez-le et laissez le fournisseur décider. Les tests de connexion et les demandes de traduction respectent le même choix.
ja_jp: 推奨フィールドを使用するか、別の互換フィールドを選択するか、送信せずにプロバイダー側の決定に任せます。接続テストと翻訳リクエストには同じ選択が適用されます。
ru_ru: Используйте рекомендуемое поле, выберите другое совместимое поле либо не указывайте его и позвольте провайдеру принять решение. Проверка подключения и запросы перевода учитывают один и тот же выбор.
zh_cn: 可使用推荐字段、切换兼容字段，或选择不发送并由服务端决定。连接测试与翻译请求会遵循同一选择。

# ModelSourceTokenLimitParameterOmitOption
source: Provider default (do not send)
fr_fr: Valeur par défaut du fournisseur (ne pas envoyer)
ja_jp: プロバイダーの既定値（送信しない）
ru_ru: По умолчанию у провайдера (не отправлять)
zh_cn: 由服务端决定（不发送）

# ModelSourceEndpoint.Header
source: Service address
fr_fr: Adresse du service
ja_jp: サービスアドレス
ru_ru: Адрес сервиса
zh_cn: 服务地址

# ModelSourceModelName.Header
source: Model name (manual entry available)
fr_fr: Nom du modèle (saisie manuelle disponible)
ja_jp: モデル名（手動入力可能）
ru_ru: Имя модели (можно ввести вручную)
zh_cn: 模型名称（可手动输入）

# ModelSourceMaxOutputTokens.Header
source: Maximum response Tokens
zh_cn: 单次响应最大 Tokens

# ModelSourceMaxOutputTokens.AutomationProperties.Name
source: Maximum response token count
zh_cn: 单次响应最大 Token 数

# ModelSourceBatchCharacters.Header
source: Source characters per batch
zh_cn: 每批原文字符目标

# ModelSourceBatchCharacters.AutomationProperties.Name
source: Translation source-character target per batch
zh_cn: 每批翻译原文字符目标

# ModelSourceRequestBudgetHelp.Text
source: Response Tokens apply to translation requests and each assistant round. The character target only controls batching for large packages and never truncates one value. Higher values may increase cost or truncation risk. The fixed 16 MiB response safety limit cannot be disabled; OpenAI-compatible sources receive no Token value when the field option above is Omit.
zh_cn: 响应 Tokens 用于翻译请求和助手每一轮；字符目标只决定大型包如何分批，不会截断单条文本。提高数值可能增加费用或截断风险。固定 16 MiB 响应安全上限不可关闭；若上方选择“不发送”，OpenAI 兼容端不会收到 Token 数值。

# DownloadedModelsTitle.Text
source: Provider-reported models
fr_fr: Modèles locaux téléchargés
ja_jp: ダウンロード済みのローカルモデル
ru_ru: Загруженные локальные модели
zh_cn: 提供方报告的模型

# RefreshModelsButtonText.Text
source: Refresh
fr_fr: Actualiser
ja_jp: 更新
ru_ru: Обновить
zh_cn: 刷新

# DownloadedModelsSelector.Header
source: Select from Ollama
fr_fr: Sélectionner depuis Ollama
ja_jp: Ollama から選択
ru_ru: Выбрать из Ollama
zh_cn: 从 Ollama 选择

# DownloadedModelsHelp.Text
source: Refresh queries the current provider catalog. Manual entry remains available; use Test connection to verify the selected model.
fr_fr: L’actualisation appelle /api/tags en local. Un service indisponible ne remplace jamais le nom de modèle saisi manuellement.
ja_jp: 更新するとローカルの /api/tags を呼び出します。サービスを利用できない場合でも、手動入力したモデル名は上書きされません。
ru_ru: При обновлении вызывается локальный /api/tags. Недоступный сервис никогда не перезаписывает имя модели, введённое вручную.
zh_cn: 刷新会查询当前提供方的模型目录；目录不可用时仍可手动输入，最终请用“测试连接”验证模型。

# ModelSourceApiKey.Header
source: API key (leave blank to retain the stored credential)
fr_fr: Clé API (laisser vide pour conserver celle qui est stockée)
ja_jp: API キー（保存済みの資格情報を保持する場合は空欄）
ru_ru: Ключ API (оставьте поле пустым, чтобы сохранить текущие учётные данные)
zh_cn: API Key（留空则保留已有凭据）

# CredentialAliasPrefix.Text
source: Credential alias:
fr_fr: Alias des informations d’identification :
ja_jp: 資格情報の別名:
ru_ru: Псевдоним учётных данных:
zh_cn: 凭据别名：

# ConnectionStatus.Title
source: Connection status
fr_fr: État de la connexion
ja_jp: 接続状態
ru_ru: Состояние подключения
zh_cn: 连接状态

# ConnectionErrorStatus.Title
source: Connection failed — check the address, model, and credential
fr_fr: Échec de la connexion — vérifiez l’adresse, le modèle et les informations d’identification
ja_jp: 接続に失敗しました — アドレス、モデル、資格情報を確認してください
ru_ru: Сбой подключения — проверьте адрес, модель и учётные данные
zh_cn: 连接失败 — 请检查地址、模型与凭据

# DeleteModelSourceButtonText.Text
source: Delete
fr_fr: Supprimer
ja_jp: 削除
ru_ru: Удалить
zh_cn: 删除

# TestConnectionButton.Content
source: Test connection
fr_fr: Tester la connexion
ja_jp: 接続をテスト
ru_ru: Проверить подключение
zh_cn: 测试连接

# SaveModelSourceButton.Content
source: Save securely
fr_fr: Enregistrer de manière sécurisée
ja_jp: 安全に保存
ru_ru: Сохранить в защищённом виде
zh_cn: 安全保存

# DeleteModelSourceDialog.Title
source: Delete model source?
fr_fr: Supprimer la source de modèle ?
ja_jp: モデルソースを削除しますか?
ru_ru: Удалить источник модели?
zh_cn: 删除模型源？

# DeleteModelSourceDialog.Content
source: The associated Windows credential is deleted too. This cannot be undone.
fr_fr: Les informations d’identification Windows associées sont également supprimées. Cette action est irréversible.
ja_jp: 関連付けられた Windows 資格情報も削除されます。この操作は元に戻せません。
ru_ru: Связанные учётные данные Windows также будут удалены. Это действие нельзя отменить.
zh_cn: 将同时删除关联的 Windows 凭据。此操作无法撤销。

# DeleteModelSourceDialog.PrimaryButtonText
source: Delete
fr_fr: Supprimer
ja_jp: 削除
ru_ru: Удалить
zh_cn: 删除

# DeleteModelSourceDialog.CloseButtonText
source: Cancel
fr_fr: Annuler
ja_jp: キャンセル
ru_ru: Отмена
zh_cn: 取消

# SettingsTitle.Text
source: Settings
fr_fr: Paramètres
ja_jp: 設定
ru_ru: Настройки
zh_cn: 设置

# SettingsSubtitle.Text
source: Appearance, language, output workspace, and secure execution boundaries.
fr_fr: Apparence, langue, espace de travail de sortie et limites d’exécution sécurisée.
ja_jp: 外観、言語、出力ワークスペース、安全な実行境界を設定します。
ru_ru: Внешний вид, язык, рабочая область вывода и границы безопасного выполнения.
zh_cn: 外观、语言、输出工作区与安全执行边界。

# SettingsError.Title
source: Settings error
fr_fr: Erreur de paramètres
ja_jp: 設定エラー
ru_ru: Ошибка настроек
zh_cn: 设置错误

# SettingsStatus.Title
source: Settings saved
fr_fr: Paramètres enregistrés
ja_jp: 設定を保存しました
ru_ru: Настройки сохранены
zh_cn: 设置已保存

# AppearanceSectionTitle.Text
source: Appearance and language
fr_fr: Apparence et langue
ja_jp: 外観と言語
ru_ru: Внешний вид и язык
zh_cn: 外观与语言

# LanguageSelector.Header
source: Display language
fr_fr: Langue de l’interface
ja_jp: 表示言語
ru_ru: Язык интерфейса
zh_cn: 显示语言

# LanguageRestartHelp.Text
source: After choosing a language, select Save and restart so LocaleSmith can reload every UI resource.
fr_fr: Après avoir choisi une langue, sélectionnez Enregistrer et redémarrer afin que LocaleSmith recharge toutes les ressources de l’interface.
ja_jp: 言語を選択した後、「保存して再起動」を選ぶと、LocaleSmith がすべての UI リソースを再読み込みします。
ru_ru: После выбора языка нажмите «Сохранить и перезапустить», чтобы LocaleSmith заново загрузил все ресурсы интерфейса.
zh_cn: 选择新语言后，请点击“保存并重启”，LocaleSmith 将重新加载全部界面资源。

# LanguageRestartButton.Content
source: Save and restart
fr_fr: Enregistrer et redémarrer
ja_jp: 保存して再起動
ru_ru: Сохранить и перезапустить
zh_cn: 保存并重启

# LanguageRestartButton.AutomationProperties.Name
source: Save the display language and restart LocaleSmith
fr_fr: Enregistrer la langue de l’interface et redémarrer LocaleSmith
ja_jp: 表示言語を保存して LocaleSmith を再起動
ru_ru: Сохранить язык интерфейса и перезапустить LocaleSmith
zh_cn: 保存显示语言并重启译匠

# ThemeSelector.Header
source: Theme
fr_fr: Thème
ja_jp: テーマ
ru_ru: Тема
zh_cn: 主题

# ThemeOptionSystem
source: System
fr_fr: Système
ja_jp: システム
ru_ru: Системная
zh_cn: 跟随系统

# ThemeOptionLight
source: Light
fr_fr: Clair
ja_jp: ライト
ru_ru: Светлая
zh_cn: 浅色

# ThemeOptionDark
source: Dark
fr_fr: Sombre
ja_jp: ダーク
ru_ru: Тёмная
zh_cn: 深色

# ForceAppAnimationsToggle.Header
source: Force app animations
fr_fr: Forcer les animations de l’application
ja_jp: アプリのアニメーションを強制的に有効化
ru_ru: Принудительно включить анимацию приложения
zh_cn: 强制启用应用动画

# ForceAppAnimationsToggle.OffContent
source: Follow system setting
fr_fr: Suivre le réglage système
ja_jp: システム設定に従う
ru_ru: Следовать системной настройке
zh_cn: 遵循系统设置

# ForceAppAnimationsToggle.OnContent
source: Forced on
fr_fr: Forcées
ja_jp: 強制的に有効
ru_ru: Принудительно включено
zh_cn: 已强制启用

# ForceAppAnimationsToggle.AutomationProperties.Name
source: Force LocaleSmith app animations
fr_fr: Forcer les animations de l’application LocaleSmith
ja_jp: LocaleSmith のアニメーションを強制的に有効化
ru_ru: Принудительно включить анимацию LocaleSmith
zh_cn: 强制启用译匠应用动画

# ForceAppAnimationsHelp.Text
source: By default, LocaleSmith follows the Windows animation-effects setting. Turn this on to keep only LocaleSmith's own page and status transitions running when Windows animations are off. It does not change Windows or other apps.
fr_fr: Par défaut, LocaleSmith suit le réglage des effets d’animation de Windows. Activez cette option pour conserver uniquement les transitions de page et d’état propres à LocaleSmith lorsque les animations Windows sont désactivées. Elle ne modifie ni Windows ni les autres applications.
ja_jp: 既定では、LocaleSmith は Windows の「アニメーション効果」設定に従います。有効にすると、Windows のアニメーションが無効な場合でも、LocaleSmith 独自のページと状態の切り替えだけは動作します。Windows や他のアプリの設定は変更しません。
ru_ru: По умолчанию LocaleSmith следует настройке эффектов анимации Windows. Включите этот параметр, чтобы переходы между страницами и состояниями только в LocaleSmith продолжали работать, когда анимация Windows отключена. Настройки Windows и других приложений не изменяются.
zh_cn: 默认遵循 Windows“动画效果”设置。开启后，即使系统关闭动画，译匠自己的页面与状态过渡仍会运行；不会修改 Windows 或其他应用的设置。

# WorkspaceSectionTitle.Text
source: Output workspace
fr_fr: Espace de travail de sortie
ja_jp: 出力ワークスペース
ru_ru: Рабочая область вывода
zh_cn: 输出工作区

# SettingsWorkspacePath.Header
source: Translation workspace root
fr_fr: Racine de l’espace de travail de traduction
ja_jp: 翻訳ワークスペースのルート
ru_ru: Корень рабочей области перевода
zh_cn: 翻译工作区根目录

# SettingsWorkspacePath.AutomationProperties.Name
source: Translation workspace root path
fr_fr: Chemin racine de l’espace de travail de traduction
ja_jp: 翻訳ワークスペースのルートパス
ru_ru: Путь к корню рабочей области перевода
zh_cn: 翻译工作区根目录路径

# SettingsWorkspaceHelp.Text
source: Output is written under LocaleSmith.Output here. Drive roots, reparse paths, and output inside a source directory are blocked.
fr_fr: La sortie est écrite ici sous LocaleSmith.Output. Les racines de lecteur, les chemins contenant des points de réanalyse et les sorties placées dans un répertoire source sont bloqués.
ja_jp: 出力は、ここにある LocaleSmith.Output の下へ書き込まれます。ドライブのルート、再解析ポイントを含むパス、ソースディレクトリ内への出力は使用できません。
ru_ru: Выходные данные записываются здесь в LocaleSmith.Output. Корни дисков, пути с точками повторной обработки и размещение результата внутри исходного каталога запрещены.
zh_cn: 输出会写入此目录下的 LocaleSmith.Output；禁止磁盘根目录、重解析路径，以及将目录包输出到其自身内部。

# LogDirectorySectionTitle.Text
source: Translation logs
fr_fr: Journaux de traduction
ja_jp: 翻訳ログ
ru_ru: Журналы переводов
zh_cn: 翻译日志

# SettingsLogDirectoryPath.Header
source: Log storage directory
fr_fr: Répertoire de stockage des journaux
ja_jp: ログの保存先ディレクトリ
ru_ru: Каталог хранения журналов
zh_cn: 日志存储目录

# SettingsLogDirectoryPath.AutomationProperties.Name
source: Translation log storage directory path
fr_fr: Chemin du répertoire de stockage des journaux de traduction
ja_jp: 翻訳ログの保存先ディレクトリパス
ru_ru: Путь к каталогу хранения журналов перевода
zh_cn: 翻译日志存储目录路径

# BrowseLogDirectoryButton.Content
source: Browse…
fr_fr: Parcourir…
ja_jp: 参照…
ru_ru: Обзор…
zh_cn: 浏览…

# BrowseLogDirectoryButton.AutomationProperties.Name
source: Choose the translation log directory
fr_fr: Choisir le répertoire des journaux de traduction
ja_jp: 翻訳ログディレクトリを選択
ru_ru: Выбрать каталог журналов перевода
zh_cn: 选择翻译日志目录

# SettingsLogDirectoryHelp.Text
source: Choose a local directory and save. New translations write bounded background .log entries there, retaining the newest 500 sessions. Slow diagnostics never block translation; API keys and full prompts are never logged.
fr_fr: Choisissez un répertoire local et enregistrez. Les nouvelles traductions y écrivent en arrière-plan des entrées de journal .log de taille limitée et conservent les 500 sessions les plus récentes. Des diagnostics lents ne bloquent jamais la traduction ; les clés API et les invites complètes ne sont jamais journalisées.
ja_jp: ローカルディレクトリを選択して保存してください。以降の翻訳では、上限付きのバックグラウンド処理で .log を書き込み、最新 500 セッションを保持します。低速な診断処理が翻訳を妨げることはなく、API キーや完全なプロンプトが記録されることもありません。
ru_ru: Выберите локальный каталог и сохраните настройки. Новые переводы записывают туда в фоне данные ограниченного объёма в файлы .log, сохраняя последние 500 сеансов. Медленная диагностика никогда не блокирует перевод; ключи API и полные запросы не журналируются.
zh_cn: 请选择本地目录并保存；下一次翻译起以有界后台队列写入 .log，并保留最新 500 次会话。慢速日志不会阻塞翻译，也不会记录 API Key 或完整提示词。

# SecuritySectionTitle.Text
source: CLI security boundary
fr_fr: Périmètre de sécurité CLI
ja_jp: CLI のセキュリティ境界
ru_ru: Граница безопасности CLI
zh_cn: CLI 安全边界

# SettingsSandboxPath.Header
source: Allowed sandbox root
fr_fr: Racine autorisée du bac à sable
ja_jp: 許可するサンドボックスのルート
ru_ru: Разрешённый корень песочницы
zh_cn: 允许的沙箱根目录

# SettingsSecurityHelp.Text
source: The policy always retains the system temp root and rejects drive roots, system directories, reparse paths, excessive timeouts, and blacklisted commands.
fr_fr: La stratégie conserve toujours la racine temporaire du système et refuse les racines de lecteur, les répertoires système, les chemins de réanalyse, les délais excessifs et les commandes interdites.
ja_jp: ポリシーでは常にシステムの一時ディレクトリを許可し、ドライブのルート、システムディレクトリ、再解析ポイントを含むパス、過大なタイムアウト、ブラックリスト登録済みのコマンドを拒否します。
ru_ru: Политика всегда оставляет разрешённым системный временный каталог и отклоняет корни дисков, системные каталоги, пути с точками повторной обработки, чрезмерные тайм-ауты и запрещённые команды.
zh_cn: 策略始终保留系统临时目录，并拒绝磁盘根、系统目录、重解析路径、超时及黑名单命令。

# McpCliDisabledHelp.Text
source: The MCP CLI execution tool always stays hidden and disabled; project mutations are enabled only when the user explicitly authorizes the current assistant turn.
fr_fr: L’outil d’exécution CLI MCP reste toujours masqué et désactivé ; les mutations du projet ne sont activées que si l’utilisateur autorise explicitement le tour actuel de l’assistant.
ja_jp: MCP の CLI 実行ツールは常に非表示かつ無効です。プロジェクトの変更は、ユーザーが現在のアシスタントターンを明示的に許可した場合にのみ有効になります。
ru_ru: Инструмент выполнения команд MCP CLI всегда скрыт и отключён; изменения проекта доступны только после явного разрешения пользователя для текущего шага ассистента.
zh_cn: MCP 的 CLI 执行工具始终隐藏且禁用；项目写操作仅在模组助手中由用户对本轮消息明确授权后启用。

# SaveSettingsButton.Content
source: Save settings
fr_fr: Enregistrer les paramètres
ja_jp: 設定を保存
ru_ru: Сохранить настройки
zh_cn: 保存设置

# CliConfirmationDialog.Title
source: Model-proposed command
fr_fr: Commande proposée par le modèle
ja_jp: モデルが提案したコマンド
ru_ru: Команда, предложенная моделью
zh_cn: 模型建议执行命令

# CliConfirmationDialog.PrimaryButtonText
source: Run command
fr_fr: Exécuter la commande
ja_jp: コマンドを実行
ru_ru: Выполнить команду
zh_cn: 执行命令

# CliConfirmationDialog.CloseButtonText
source: Cancel
fr_fr: Annuler
ja_jp: キャンセル
ru_ru: Отмена
zh_cn: 取消
